{
    "filters": [
        {
            "filter": "all",
            "label": "All"
        },
        {
            "filter": "webdevelopment",
            "label": "Web development"
        },
        {
            "filter": "webdesign",
            "label": "Web design"
        },
        {
            "filter": "misc",
            "label": "Miscellaneous"
        }
    ],
    "items": [
      {
          "title": "BBC News: How much warmer is your city?",
          "img-src": "./assets/img/climate-change-calc.png",
          "filters": "webdevelopment",
          "desc": "Interactive article highlighting the impacts of climate change on a local level",
          "link": "https://www.bbc.co.uk/news/resources/idt-985b9374-596e-4ae6-aa04-7fbcae4cb7ee",
          "mockup-img": "./assets/img/mockUps/climate-change-chart.png",
          "full-desc": ["This was an in depth project looking at how climate change is predicted to impact temperatures in cities around the world.",
            "I worked closely with our trainee developer, mentoring and learning from him throughout the process. We built the project using Handlebars, SASS, JS(ES6), Three.js and D3.",
            "He was responsible for creating and optimising the globe using Three.js, whilst I concentrated on the scrolly chart section. I adapted the Pudding's Scrollama library to work with our bespoke internal scaffold, and gracefully degrade for older browsers (such as IE11). I built the chart using D3, with events to sync it up to the scrolly.",
            "We concentrated on accessibility, making sure everybody would be able to engage with and enjoy the project. One of the ways we did this was by implementing an animation toggle, seen in the 'Gender pay gap' scrolly project previously. It was taken further this time - starting and stopping animations on multiple different elements using event emitters. We also synced it to the ‘prefers reduced motion’ option on user's devices - so if this is enabled, animations would automatically be disabled.",
            "The project was translated into approximately 27 different languages. This meant it would be accessed by people all over the world, on different devices, connections and with differing amounts of data available. Therefore, we had to be mindful of performance. We did this in a variety of ways - from making sure all the images were optimised and lazy loaded, to chunking all the data for each city into individual files.",
            "Another way we optimised the project was to create a great no javascript experience. All the main text content was still available, apart from the personalised city results. The interactive elements had some sort of fallback, and a message to upgrade your browser for the full experience. We also made sure that the lazy loaded images would still be visible if a user had disabled js using the noscript tags.",
            "The project was a great success, seen by over 1.2 million people in the first 3 days and longlisted for an Kantar Information is Beautiful award."        ]
      },
      {
          "title": "BBC News: Poll tracker 2019/2020",
          "img-src": "./assets/img/polltracker.png",
          "filters": "webdevelopment",
          "desc": "Compare how the UK political parties are performing in the polls",
          "link": "https://www.bbc.co.uk/news/uk-politics-49798197",
          "mockup-img": "./assets/img/mockUps/polltracker.png",
          "full-desc": ["A project showing how each of the UK political parties are performing in the polls, built using JS (ES6), D3, Handlebars and Sass.",
            "I focused more effort on the back-end of this project than we usually do for Visual Journalism projects.",
            "For the core content / fallback, we decided to output a screenshot of the graph, to give users as full an experience as possible. I wrote a Node script to use Puppeteer to go to the project, take a screenshot of the graph at different viewport dimensions and save these locally. They are then pulled in as a fallback image for the graph.",
            "We have one large dataset powering the three visual products on the page (the chart, the pictogram and the table of polls). This needs to be transformed and manipulated differently for each product. I worked with the data team to help them write JavaScript to filter and manipulate the data, which we could then run as a Node script during the build process. We could then format the resulting dataset how we needed for each product and output it as separate JSON files locally to the project.",
            "We developed an auto deployment strategy, so the poll tracker could be updated out of hours without the need for a developer. </br> I used an AWS Lambda, running every minute, to check the data against a local copy to see if it had been updated. If it had, it would then trigger a Jenkins job. Jenkins would build the project, run the data formatting tasks and generate an updated screenshot for the fallback content. I configured it to notify a Slack channel with it's progress - particularly focussing on descriptive erorr messages. This would allow the journalists to know if something went wrong. If it was successful, Jenkins would then deploy the project.",
            "We wrote some unit tests to accompany this data formatting to make sure the data being pulled in and being outputted was how we expected it to be formatted and the values were within expected ranges. This was especially important because the auto deployment solution meant less manual checking / testing than when a project is usually updated."
        ]
      },
      {
          "title": "BBC News: Falling through the pay gap",
          "img-src": "./assets/img/gpg-scrolly.png",
          "filters": "webdevelopment",
          "desc": "Scrollytelling article highlighting the gender pay gap in the UK",
          "link": "https://rushlet.github.io/ci301_data-vis/website/index.html",
          "mockup-img": "./assets/img/mockUps/gender-pay-gap-scrolly.png",
          "full-desc": ["This was an ambitious project experimenting with scrollytelling. The first big challenge was trying to visualise the dataset. We wanted to render a dot representing each company in the dataset, and animate these inline with the text. There were over 10,000 companies in the data, which is no small feat to render on a page. We managed to do this using REGL (based on WebGL) and D3.",
            "I spent a lot of time making sure it was inclusive and accessible, this meant considering things like how users could interact with it using only a keyboard, or a screenreader. I read about accessibility considerations in scrollytelling and animated content, and found one particular article of great help. We didn’t want people feeling overwhelmed or nauseated by our exciting new scrolly, so to cater to users with vestibular impairments, or those who just don’t like animation, I implemented a toggle at the beginning of the article. This was accompanied by a trigger warning - notifying users that this article contained animation and offering them an option upfront to stop that, without taking the content away from them.",
            "I have had opportunites to speak about our experience developing this new storytelling format and making it accessible, speaking about the project at the Smashing Conference warm up party in San Francisco & the Creative Coding London meetup."
        ]
      },
    {
        "title": "A visual analysis of UK number 1s",
        "img-src": "./assets/img/visual-analysis-uk-number1s.png",
        "filters": "webdevelopment webdesign misc",
        "desc": "Interactive article showing trends in UK number 1 songs, using Spotify data",
        "link": "https://rushlet.github.io/ci301_data-vis/website/index.html",
        "mockup-img": "./assets/img/mockUps/visual-analysis-of-uk-number-1s.png",
        "full-desc": ["Spotify produces quantitative data for every song in their library on characteristics such as ‘danceability’, ‘valence’ and ‘energy’.",
        "To give it contextualise this data, this project presents an analysis of songs which have reached number 1 in the UK charts. These are compared on attributes such as when they were number one or how long they were number 1 for.",
        "The findings of this analysis are presented online, with interactive data visualisations created with JavaScript. An element of personalisation is added to the website by encouraging users to log in with their Spotify account to see how their favourite songs compare with those that have reached number 1.",
        "The data was gathered using custom python and node scripts, it was then analysed using R. The website was built with JavaScript, Scrollama, D3, the Spotify Web API library as well as Webpack and Gulp. Unit tests were written for the site using Mocha and Chai, and further tests were conducted using Ruby & Cucumber."
      ]
    }, {
        "title": "BBC News: Climate change calculator",
        "img-src": "./assets/img/greendiet.png",
        "filters": "webdevelopment",
        "desc": "Calculator showing the impact of your dietary choices on climate change",
        "link": "https://www.bbc.co.uk/news/science-environment-46459714",
        "mockup-img": "./assets/img/mockUps/climate-change-calculator.png",
        "full-desc": ["The project showcases the climate impact of the foods we eat. The user can select a food from our list and indicate how often they eat it. They are then shown how their choices impact the environment, putting emissions into context by comparing them to flights or water usage to showers. A graph is displayed comparing the food to similar items, and the user can select another item from a random selection on the shelf at the bottom of the interactive.",
          "This was a project in which we were encouraging our graduate developer to take the lead. My role was to support him as best I could, by doing code reviews, talking through decisions and doing the tasks he assigned to me. I took primary responsibility for the styling and accessibility of the project. This included making sure the 'choose another item' section met the designers specifications whilst also being usable for keyboard only users or those using screen readers to access the article."]
    }, {
        "title": "BBC News: Freedom trash can",
        "img-src": "./assets/img/trashcan.png",
        "filters": "webdevelopment",
        "desc": "Drag items of female oppression into the freedom trash can",
        "link": "https://www.bbc.co.uk/news/world-46116262",
        "mockup-img": "./assets/img/mockUps/freedom-trashcan.png",
        "full-desc": ["This project marks 100 years since women threw items of oppression into a burning bin and features items women today said in a survey they would want to get rid of. It is a drag and drop game, featuring animations and quotes from readers. When an item is binned you can choose to read more about the history of it and its relationship with female oppression. It was translated into 25 languages.",
          "I was lead developer on this project, responsible for the majority of the development work. The main challenge was to create a drag and drop interface across a variety of devices and browsers (including Internet Explorer) and taking accessibility concerns into consideration - such as screen reader or keyboard-only users - making sure they could still interact with the game."]
    },
    {
        "title": "BBC News: NHS Tracker 2019",
        "img-src": "./assets/img/nhstracker.png",
        "filters": "webdevelopment",
        "desc": "See how your local NHS trust is matching up to government targets",
        "link": "https://www.bbc.co.uk/news/health-41483322",
        "mockup-img": "./assets/img/mockUps/nhs-tracker.png",
        "full-desc": ["The tracker shows users how well their local health services are meeting the government targets for their area.",
          "I was the lead developer on this interactive piece, updating the previous version for 2018 to include mental health figures. This was easier said than done, as mental health is funded slightly differently and therefore data is recorded differently, and different terminology is used. As part of this project, I was mentoring two junior developers. This involved pairing with them on certain aspects, assigning them their own tasks, being on hand to talk through any issues and provide code reviews. This was a challenge whilst juggling my own workload, but I received positive feedback from everybody involved."]
    },
    {
        "title": "BBC News: Gender pay gap calculator",
        "img-src": "./assets/img/gpg.png",
        "filters": "webdevelopment",
        "desc": "See how your company's gender pay gap compares",
        "link": "https://www.bbc.co.uk/news/science-environment-46459714",
        "mockup-img": "./assets/img/mockUps/gender-pay-gap.png",
        "full-desc": ["This project highlights the gender pay gap across a number of companies as of 2019.",
          "I was part of a team of 3 developers working on the project due to a short deadline. I was primarily responsible for displaying and styling the text, making sure it was formatted correctly and doing any necessary calculations. Due to the number of people working on the project, I also took it upon myself to take lead on some of the project management aspects - making sure tasks were broken down and assigned to each person, and collaborating with editorial to make sure each task was clear and prioritised."]
    },
    {
        "title": "BBC News: Best place to be young",
        "img-src": "./assets/img/nhstracker.png",
        "filters": "webdevelopment",
        "desc": "See how your local NHS trust is matching up to government targets",
        "link": "https://www.bbc.co.uk/news/health-41483322",
        "mockup-img": "./assets/img/mockUps/nhs-tracker.png",
        "full-desc": ["The tracker shows users how well their local health services are meeting the government targets for their area.",
          "I was the lead developer on this interactive piece, updating the previous version for 2018 to include mental health figures. This was easier said than done, as mental health is funded slightly differently and therefore data is recorded differently, and different terminology is used. As part of this project, I was mentoring two junior developers. This involved pairing with them on certain aspects, assigning them their own tasks, being on hand to talk through any issues and provide code reviews. This was a challenge whilst juggling my own workload, but I received positive feedback from everybody involved."]
    },{
        "title": "Croaked",
        "img-src": "./assets/img/croaked.png",
        "filters": "webdevelopment webdesign misc",
        "desc": "Multiplayer networked game, inspired by Pacman and Crawl",
        "link": "https://github.com/rushlet/ci328_networked-game",
        "mockup-img": "./assets/img/mockUps/croaked.png",
        "full-desc": ["Croaked is a multiplayer networked online game, inspired by Pacman and Crawl.",
          "The game can 1 - 4 players, the remaining players are controlled using artificial intelligence. When a game is started one player is the hero, whose mission is to collect as many coins as possible before time runs out. The other players are ghosts who aim to catch the hero. Once a ghost catches the hero, they become the hero and can now start collecting coins and gaining points. The winner is the player with the most points at the end of the game. There are mystery power ups and power downs along the way - which may temporarily double or half points gained or the speed you can move at.",
          "I worked with a friend to build the game using Node and Socket.io on the server-side, with Javascript and Phaser on the client-side."]
    }, {
        "title": "BBC News: What has Trump said about your country?",
        "img-src": "./assets/img/bbc-trump-talk.png",
        "filters": "webdevelopment",
        "desc": "Trump's relationship with other countries, summarised with tweets and emojis",
        "link": "http://www.bbc.co.uk/news/world-us-canada-39732845",
        "mockup-img": "./assets/img/mockUps/trumpTalk-mockup.png",
        "full-desc": ["I was lead developer on this interactive piece marking Trump's first 100 days in office. I made use of Handlebars, custom Grunt tasks, as well as SASS, JavaScript (ES6) and JQuery to build this project to the specifications of the dedicated journalist and designer.",
          "I made use of Handlebars custom helpers to run JavaScript code server-side (such as creating a section of countries ordered by most tweets) to provide a good non-js experience.",
          "I wrote unit tests for a few of the key functions using Mocha and Chai and tested it more generally using Ruby & Cucumber to check it acted as we had originally intended.",
          "It was featured on the homepage of BBC News and recieved over 1 million views on the first day.",
          "My manager had this to say about the project: <blockquote>Becky was the lead developer on the 'What has President Trump said about your country?' project. It was very popular, and technically is one of our best examples of progressive enhancement. It was built to be accessible and reusable - and Becky was so ahead of the deadline that she was able to write integration tests for it using Ruby and Cucumber.</blockquote>"]
    },
    {
        "title": "BBC News: Which world leader are you?",
        "img-src": "./assets/img/bbc-world-leaders.png",
        "filters": "webdevelopment",
        "desc": "Which world leader are you most like?",
        "link": "http://www.bbc.co.uk/news/world-37833792",
        "mockup-img": "./assets/img/mockUps/world-leaders__MockUp.png",
        "full-desc": ["This was the first big project I helped develop whilst working in Visual Journalism at BBC News. I was part of a small team including a journalist, designer, project manager and another developer. I worked closely with the more senior developer to create this interactive feature; a global data project, published in over 20 languages on the BBC News website which compared the user to 180 world leaders on factors such as age and education.",
        "I was responsible for building and implementing the graphs, charts and slow reveal using vanilla JavaScript, HTML and CSS. I also took on styling the page for right to left reading languages and inserting SVGs created by our dedicated designer. We worked together with a tester to find issues with the interactive displaying across various devices and browsers and fix as many as possible before the go-live date. It was a tense and exciting project in which I learnt a lot. I have written a blog post on the experience, if you would like to find out more."]
    },
    {
        "title": "BBC News: How long could my summer flight be delayed?",
        "img-src": "./assets/img/bbc-flights1.png",
        "filters": "webdevelopment",
        "desc": "Compare airline's average flight delays on various routes",
        "link": "http://www.bbc.co.uk/news/business-40831970",
        "mockup-img": "./assets/img/mockUps/flightDelats_mockup.png",
        "full-desc": ["One of my final projects whilst working as a trainee in Visual Journalism was 'How long could my summer holiday flight be delayed?'. I was a co-developer on this piece, which received almost 1.5 million hits on the first day it was published.",
          "Working with a team of journalists, a designer, and another developer, my role involved writing an algorithm to make sure the bars always fitted onscreen inline with the text, animating the carousel at the top using CSS and data handling, as well as building the majority of the project."]
    },
    {
        "title": "BBC News: 6 things that could topple Trump's border wall",
        "img-src": "./assets/img/bbc-trump-wall.png",
        "filters": "webdevelopment",
        "desc": "Interactive article discussing the issues affecting Trump's plan for a border wall",
        "link": "https://www.bbc.co.uk/news/resources/idt-d60acebe-2076-4bab-90b4-0e9a5f62ab12",
        "mockup-img": "./assets/img/mockUps/trumpWall.png",
        "full-desc": ["I was co-developer on this interactive piece, discussing what obstacles Trump may encouter in building the US/Mexico border wall. My role was to support the lead developer in building this long form article, working alongside two journalists and a designer.",
          "For this project, we were using a content framework built by one of the senior developers in our team. This was one of the first projects we had used it for, so we were still getting to grips with it. We created components which make up the article - such as a video, an image or a quote section - with Handlebars, JavaScript and SASS and released them via our NPM repo. This allowed us to easily install them and adapt them for our specific use cases. I took responsibility for ensuring that users accessing the story from older browsers (such as IE8), or with JavaScript turned off, would still have an engaging experience - with as many assets working as possible. I also wrote a few grunt scripts to handle various tasks we needed to cover in the process.",
          "The article was released across the BBC World Service sites, in 10 different languages."
        ]
    },
    {
        "title": "Kemp Town Carnival website",
        "img-src": "./assets/img/ktc.png",
        "filters": "webdevelopment webdesign",
        "desc": "Wordpress website for a much loved Brighton community event",
        "link": "http://kemptowncarnival.com/",
        "mockup-img": "./assets/img/mockUps/ktc.png",
        "full-desc": ["Kemp Town Carnival is a Brighton based free community event. I was asked to redesign the existing WordPress site, to make it easier for the team to update and to make it more aesthetically engaging for users visiting the site. I worked closesly with Mat, the organiser, alongside a designer and digital marketer, to discuss how we felt the site should be laid out.",
          "I had a very short period of time to build the new site, so I opted to use the existing WordPress site but change the theme, add a variety of plugins and write a significant amount of custom CSS and JavaScript. The team were very pleased with the website I produced, which included all the features we had wanted initially - a latest news page, a 'subscribe to newsletter' widget and a design which is unified with other products associated with the event."
        ]
    },
    {
        "title": "Liz Eeles website",
        "img-src": "./assets/img/liz-eeles.png",
        "filters": "webdevelopment webdesign",
        "desc": "Wordpress website for a romance author, Liz Eeles",
        "link": "http://lizeeles.com/",
        "mockup-img": "./assets/img/mockUps/liz-eeles.png",
        "full-desc": ["I worked closely with Liz over an extended period of time to build a simple website to promote her holiday romance novels and showcase blog posts.",
          "I opted to build the site using WordPress to allow Liz to later update it easily for herself - adding blog posts and new books. To make it bespoke to Liz's ideas of how she wanted it to look, I adapted an existing theme with a significant amount of custom CSS and JavaScript."]
    },
    {
        "title": "BBC News: Coffee under threat",
        "img-src": "./assets/img/bbc-coffee.png",
        "filters": "webdevelopment",
        "desc": "How is climate change impacting coffee production?",
        "link": "http://www.bbc.co.uk/news/resources/idt-fa38cb91-bdc0-4229-8cae-1d5c3b447337",
        "mockup-img": "./assets/img/mockUps/coffee.png",
        "full-desc": ["I worked closely with a BBC Journalist to create this article page about a study released on the effect of climate change on coffee production. I built the page using our team's internal content framework, which involved writing code in Handlebars, SASS and JavaScript.",
          "One interesting challenge with this project was that it used content that was under embargo. This meant we couldn't build or test it with the final assets or translations (it was being released in 10 languages). Although this was potentially problematic, we successfully used palceholder assets and text until the embargo deadline and then worked quickly to replace the content, re-test it and publish the article."]
    },
    {
        "title": "Don't Panic",
        "img-src": "./assets/img/dont-panic.png",
        "filters": "webdevelopment webdesign",
        "desc": "An online mobile game",
        "link": "https://rushlet.github.io/ci328-coursework/",
        "mockup-img": "./assets/img/mockUps/dont-panic.png",
        "full-desc": ["Don’t Panic is an Endless Runner style game, inspired by ‘Hitchhiker’s Guide to the Galaxy’, designed to be played on desktop or mobile. The user plays as a rocket, using arrow keys or by pressing on the side of the screen to travel towards to navigate through outer space - avoiding alien abductions and collecting coins. The player is armed with a Random Reassignment Button - inspired by Douglas Adams’ Infinite Improbability Drive (though with far less possibilities) when it's ready to be activated, it will appear in the bottom right hand corner. Clicking on it could trigger regeneration into a different galaxy or maybe even the spontaneous apparition of a bowl of flowers.",
          "I wrote the game using JavaScript, incluing the Phaser.js library."]
    },
    {
        "title": "Up For It?",
        "img-src": "./assets/img/bbc-trump-talk.png",
        "filters": "webdevelopment",
        "desc": "Website showcasing outreach work in sexual health",
        "link": "UK-number-1s.html",
        "mockup-img": "./assets/img/mockUps/trumpTalk-mockup.png",
        "full-desc": ["This was a website I worked on for a client, Elsie, who was doing her PhD. She wanted a portfolio to showcase the different outreach work she had been doing, teaching young people about sexual health.",
          "I was given creative freedom, though worked closely with Elsie to discuss her ideas and implement them as best I could. I built the website from scratch, in HTML, CSS and JavaScript, using the Skeleton framework.",
          "I also dedicated time to optimising the SEO score of the site, testing it across multiple devices and conducting user testing."
        ]
    }
],
"writings": [
  {
    "article": "test 1",
    "link": ""
  },
  {
    "article": "test 2",
    "link": ""
  },
  {
    "article": "test 3",
    "link": ""
  }
],
"speakings" : [
  {
    "event": "example 1",
    "date": "14/09/2019",
    "link": ""
  },
  {
    "event": "example 2",
    "date": "",
    "link": ""
  },
  {
    "event": "example 3",
    "date": "",
    "link": ""
  }
],
"testimonials": [
  {
    "person": "Chris Ashton",
    "job": "Senior Web Developer",
    "company": "BBC News",
    "image": "./assets/img/chris.jpg",
    "link": "https://www.linkedin.com/in/chrisbashton/",
    "testimonial": "Becky was able to build on her front-end knowledge and enthusiastically picked up new skills throughout her time as a trainee in Visual Journalism. After a few months she was as productive as any of our full-time developers"
  },
  {
    "person": "Mat Cook",
    "job": "Director",
    "company": "CooktheRabbit Events",
    "image": "./assets/img/mat.jpg",
    "link": "https://uk.linkedin.com/in/mat-cook-ab358b2b",
    "testimonial": "Becky is a wonderful person to work with and has been a great asset to all of the city event projects we have delivered. She is a natural problem solver and has shown a clear understanding of our needs as well as providing clever solutions when needed. She rocks!"
  },
  {
    "person": "Liz Eeles",
    "job": "Author",
    "image": "./assets/img/liz.jpg",
    "link": "https://www.linkedin.com/in/liz-eeles-b7544228/",
    "testimonial": "I knew how I wanted my author website to look and work - but had no idea how to make it happen. Fortunately, Becky stepped in and created a website that I love. She talked me through the process, answered all my IT questions – even the daft ones – and provided great value for money."
  },
  {
    "person": "Elsie Whittington",
    "job": "PhD Student",
    "company": "Sussex University",
    "image": "./assets/img/elsie.jpg",
    "link": "https://uk.linkedin.com/in/elsie-whittington-5785333b",
    "testimonial": "Working with Becky to develop my website has been a really useful and positive experience. I found her to be patient and attentive to what I wanted from the website. I don't have a technical background so I was reassured by her use of simple, but not patronizing, language to explain to me what she was doing and if and how things may or may not work."
  },
  {
    "person": "Vince Sears",
    "job": "Chairman",
    "company": "Field Marketing Solutions",
    "image": "./assets/img/vince.jpg",
    "link": "https://uk.linkedin.com/in/vince-sears-93773916",
    "testimonial": "Accurate and creative work not usually found in one so young"
  },
  {
    "person": "Jonathan Hitchens",
    "job": "CEO",
    "company": "TMC",
    "image":"./assets/img/jonathan.jpg",
    "link": "https://uk.linkedin.com/in/jonathan-hitchens-06963412",
    "testimonial": "Rebecca was fundamental in the construction of many of our promotions and would make an excellent addition to any team."
  },
  {
    "person": "Ross Sampson",
    "job": "Founder",
    "company": "RSS Solutions",
    "image": "./assets/img/ross.jpg",
    "link": "https://nl.linkedin.com/in/rosss",
    "testimonial": "Becky is a joy to work with"
  }
]
}
